In [8]:
import pandas as pd

In [9]:
print("inicio--")

inicio--

In [11]:
contatos_df = pd.read_excel("contatos.xlsx")

In [12]:
display(contatos_df)

      Nome       Numero  UF        Cidade Filiado
0  Emerson  11983251254  SP     são paulo     sim
1     Joao  11988288228  SP      Garulhos     sim
2    Luiza  11976237171  SP     são paulo     sim
3   Marcos  21987233231  RJ       Resende     não
4    maria  41981271737  MG  Cidade Dutra     não

In [13]:
display(contatos_df.head())
display(contatos_df.head(2))

      Nome       Numero  UF        Cidade Filiado
0  Emerson  11983251254  SP     são paulo     sim
1     Joao  11988288228  SP      Garulhos     sim
2    Luiza  11976237171  SP     são paulo     sim
3   Marcos  21987233231  RJ       Resende     não
4    maria  41981271737  MG  Cidade Dutra     não

      Nome       Numero  UF     Cidade Filiado
0  Emerson  11983251254  SP  são paulo     sim
1     Joao  11988288228  SP   Garulhos     sim

In [15]:
display(contatos_df.shape)

(5, 5)

In [17]:
display(contatos_df.describe())

             Numero
count  5.000000e+00
mean   1.998326e+10
std    1.303803e+10
min    1.197624e+10
25%    1.198325e+10
50%    1.198829e+10
75%    2.198723e+10
max    4.198127e+10

In [18]:
numeros = contatos_df['Numero']
display(numeros)

0    11983251254
1    11988288228
2    11976237171
3    21987233231
4    41981271737
Name: Numero, dtype: int64

In [19]:
agenda = contatos_df[['Nome', 'Numero']]
display(agenda)

      Nome       Numero
0  Emerson  11983251254
1     Joao  11988288228
2    Luiza  11976237171
3   Marcos  21987233231
4    maria  41981271737

In [44]:
display(contatos_df.loc[1, 'Numero'])

11988288228

In [43]:
display(contatos_df.loc[1:2])

    Nome       Numero  UF     Cidade Filiado
1   Joao  11988288228  SP   Garulhos     sim
2  Luiza  11976237171  SP  são paulo     sim

In [25]:
display(contatos_df.loc[contatos_df['UF'] == "SP"])

      Nome       Numero  UF     Cidade Filiado
0  Emerson  11983251254  SP  são paulo     sim
1     Joao  11988288228  SP   Garulhos     sim
2    Luiza  11976237171  SP  são paulo     sim

In [27]:
display(contatos_df.loc[contatos_df['UF'] == "SP", ['Nome', 'Numero']])

      Nome       Numero
0  Emerson  11983251254
1     Joao  11988288228
2    Luiza  11976237171